Repository: wiemennajem/lastbasira
Catalog: lib/l10n/app_*.arb
Languages: ar, fr

# appTitle
source: Basira
ar: بصيرة

# welcome
source: Welcome again to Basira ! Swipe the screen to begin exploring features.
ar: مرحباً بكم من جديد في بصيرة ! اسحب الشاشة لاستكشاف الميزات.
fr: Bienvenue de nouveau à Basira. ! Glissez l'écran pour commencer à explorer les fonctionnalités.

source: Currency Identifier
ar: معرّف العملة
fr: Identificateur de monnaie

source: Text Reader
ar: قارئ النص
fr: Lecteur de texte

source: Object Finder
ar: البحث عن الأشياء
fr: Chercheur d'objet

# doubleTap
source: Double tap to activate.
ar: انقر مرتين للتفعيل.
fr: Double tap pour activer.

# swipeToChange
source: Swipe the screen to change feature.
ar: اسحب الشاشة لتغيير الميزة.
fr: Glissez l'écran pour changer la fonctionnalité.

# alignTextWithFrame
source: Align text with the frame
ar: قم بمحاذاة النص مع الإطار
fr: Alignez le texte avec le cadre

source: Reading detected text...
ar: جارٍ قراءة النص المكتشف...
fr: Lecture du texte détecté...

source: Auto-capturing in progress...
ar: جارٍ الالتقاط التلقائي...
fr: Capture automatique en cours...

# helpInstructions
source: This app helps you scan text. Move your device around until you hear 'Text is well positioned', then hold steady for auto-capture or double tap to capture manually.
ar: تساعدك هذه التطبيق على مسح النصوص. حرك جهازك حتى تسمع 'النص في وضع جيد'، ثم ثبت الجهاز للالتقاط التلقائي أو انقر مرتين للالتقاط يدويًا.
fr: Cette application vous aide à scanner du texte. Déplacez votre appareil jusqu'à entendre 'Texte bien positionné', puis maintenez-le stable pour la capture automatique ou double tapez pour capturer manuellement.

# textTooSmall
source: Text is too small. Move closer.
ar: النص صغير جدًا. اقترب أكثر.
fr: Le texte est trop petit. Approchez-vous.

# textTooLarge
source: Text is too large. Move farther away.
ar: النص كبير جدًا. ابتعد أكثر.
fr: Le texte est trop grand. Éloignez-vous.

# moveDirection
source: Move {magnitude} to the {direction}.
ar: تحرك {magnitude} إلى {direction}.
fr: Déplacez-vous {magnitude} vers {direction}.

# adjustSlightlyDirection
source: Adjust slightly to the {direction}.
ar: اضبط قليلاً إلى {direction}.
fr: Ajustez légèrement vers {direction}.

# textWellPositioned
source: Text is well positioned.
ar: النص في وضع جيد.
fr: Le texte est bien positionné.

# directionRight
source: right
ar: يمين
fr: droite

# directionLeft
source: left
ar: يسار
fr: gauche

# directionUp
source: up
ar: أعلى
fr: haut

# directionDown
source: down
ar: أسفل
fr: bas

source: a lot
ar: كثيرًا
fr: beaucoup

source: a bit
ar: قليلاً
fr: un peu

# cameraReadyMessage
source: Camera ready. Move your device to find text.
ar: الكاميرا جاهزة. حرك جهازك للعثور على النص.
fr: Caméra prête. Déplacez votre appareil pour trouver du texte.

# noTextFoundMessage
source: No text found. Move your device around to find text.
ar: لم يتم العثور على نص. حرك جهازك للعثور على النص.
fr: Aucun texte trouvé. Déplacez votre appareil pour trouver du texte.

source: Auto-capturing image.
ar: جارٍ التقاط الصورة تلقائيًا.
fr: Capture automatique de l'image.

source: Capturing image.
ar: جارٍ التقاط الصورة.
fr: Capture de l'image.

# processingErrorMessage
source: An error occurred while processing the image.
ar: حدث خطأ أثناء معالجة الصورة.
fr: Une erreur s'est produite lors du traitement de l'image.

# welcomword
source: Welcome again to Basira !
ar: مرحبًا بكم من جديد في بصيرة !
fr: Bienvenue de nouveau à Basira!

# instruction
source: Swipe the screen to begin exploring features.
ar: اسحب الشاشة لاستكشاف الميزات.
fr: Glissez l'écran pour commencer à explorer les fonctionnalités.
